{"description": [{"excerpt": "**RAWGraphs** is an open web tool to create custom vector-based visualizations on top of the amazing [d3.js](https://github.com/mbostock/d3) library.\nIt has been developed by [DensityDesign Research Lab](http://www.densitydesign.org/) ([Politecnico di Milano](http://www.polimi.it/)), [Calibro](http://calib.ro/) and [INMAGIK](https://inmagik.com/). \nPrimarily conceived as a tool for designers and vis geeks, RAWGraphs aims at providing a missing link between spreadsheet applications (e.g., LibreOffice Calc, Microsoft Excel, Apple Numbers, Google Docs) and vector graphics editors (e.g., Inkscape, Adobe Illustrator). \nRAWGraphs works with [tabular data](<https://en.wikipedia.org/wiki/Table_(information)>) (e.g., spreadsheets and comma-separated values) as well as with copied-and-pasted texts from other applications. Based on the [SVG](http://en.wikipedia.org/wiki/Svg) format, visualizations can be easily edited with vector graphics applications for further refinements or directly embedded into web pages. \nKnowing the need to work with sensitive information, the data injected into RAWGraphs is processed only by the web browser: **no server-side operations or storages are performed**. No one will see, touch or copy your data! \nRAWGraphs is also highly customizable and extensible, accepting new custom layouts defined by users. For more information about adding or editing layouts, see the [Developer Guide](https://github.com/rawgraphs/raw/wiki/Developer-Guide). \n", "confidence": [[0.8511653216745175, 0.8642576371564927, 0.956003962779361, 0.9782432487103759, 0.9689414675425567]], "technique": "Supervised classification", "originalHeader": "About"}, {"excerpt": "A web interface to create custom vector-based visualizations on top of RAWGraphs core", "confidence": [1.0], "technique": "GitHub API"}], "citation": [{"originalHeader": "Publications / Citing RAWGraphs", "excerpt": "If you have found RAWGraphs helpful in your research, or if you want to reference it in your work, please consider citing the paper we presented at [CHItaly 2017](http://sites.unica.it/chitaly2017/).\n\nyou can read the full article in Green Open Access at the following link:\n\n![oa icon](http://dl.acm.org/images/oa.gif) [RAWGraphs: A Visualisation Platform to Create Open Outputs](http://rawgraphs.io/about/#cite)\n\nCite RAWGraphs:\n\n> Mauri, M., Elli, T., Caviglia, G., Uboldi, G., & Azzi, M. (2017). RAWGraphs: A Visualisation Platform to Create Open Outputs. In _Proceedings of the 12th Biannual Conference on Italian SIGCHI Chapter_ (p. 28:1–28:5). New York, NY, USA: ACM. https://doi.org/10.1145/3125571.3125585\n\nBibtex:\n\n```\n@inproceedings{Mauri:2017:RVP:3125571.3125585,\n author = {Mauri, Michele and Elli, Tommaso and Caviglia, Giorgio and Uboldi, Giorgio and Azzi, Matteo},\n title = {RAWGraphs: A Visualisation Platform to Create Open Outputs},\n booktitle = {Proceedings of the 12th Biannual Conference on Italian SIGCHI Chapter},\n series = {CHItaly '17},\n year = {2017},\n isbn = {978-1-4503-5237-6},\n location = {Cagliari, Italy},\n pages = {28:1--28:5},\n articleno = {28},\n numpages = {5},\n url = {http://doi.acm.org/10.1145/3125571.3125585},\n doi = {10.1145/3125571.3125585},\n acmid = {3125585},\n publisher = {ACM},\n address = {New York, NY, USA},\n keywords = {Visualization tools, data visualization, open output, visual interface},\n}\n```\n", "confidence": [1], "technique": "Header extraction"}, {"excerpt": "@inproceedings{Mauri:2017:RVP:3125571.3125585,\n author = {Mauri, Michele and Elli, Tommaso and Caviglia, Giorgio and Uboldi, Giorgio and Azzi, Matteo},\n title = {RAWGraphs: A Visualisation Platform to Create Open Outputs},\n booktitle = {Proceedings of the 12th Biannual Conference on Italian SIGCHI Chapter},\n series = {CHItaly '17},\n year = {2017},\n isbn = {978-1-4503-5237-6},\n location = {Cagliari, Italy},\n pages = {28:1--28:5},\n articleno = {28},\n numpages = {5},\n url = {http://doi.acm.org/10.1145/3125571.3125585},\n doi = {10.1145/3125571.3125585},\n acmid = {3125585},\n publisher = {ACM},\n address = {New York, NY, USA},\n keywords = {Visualization tools, data visualization, open output, visual interface},\n}", "confidence": [1.0], "technique": "Regular expression"}], "installation": [{"originalHeader": "Installation", "excerpt": "If you want to run your instance of RAWGraphs locally on your machine, be sure you have the following requirements installed. The following guide is for intermediate users (you will have to open your console and type some commands, it's better if you know what you are doing).\n", "confidence": [1], "technique": "Header extraction"}], "license": {"excerpt": {"name": "Apache License 2.0", "url": "https://api.github.com/licenses/apache-2.0"}, "confidence": [1.0], "technique": "GitHub API"}, "requirement": [{"originalHeader": "Requirements", "excerpt": "If you want to run your instance of RAWGraphs locally on your machine, be sure you have the following requirements installed.\n\n- [Git](https://git-scm.com/book/en/v2/Getting-Started-Installing-Git) (it could be used through the interface of [GitHub Desktop](https://desktop.github.com/))\n- [Node.js](https://nodejs.org/en/)\n- [Yarn](https://yarnpkg.com/getting-started/install)\n", "parentHeader": "Installation", "confidence": [1], "technique": "Header extraction"}], "usage": [{"originalHeader": "Usage", "excerpt": "The easiest way to use RAWGraphs is by accessing the most updated version on the **[official app page](http://app.rawgraphs.io)**. However, RAWGraphs can also run locally on your machine: see the installation instructions below for know-how.\n", "confidence": [1], "technique": "Header extraction"}], "codeRepository": {"excerpt": "https://github.com/rawgraphs/rawgraphs-app", "confidence": [1.0], "technique": "GitHub API"}, "owner": {"excerpt": "rawgraphs", "confidence": [1.0], "technique": "GitHub API"}, "ownerType": {"excerpt": "Organization", "confidence": [1.0], "technique": "GitHub API"}, "dateCreated": {"excerpt": "2013-04-17T11:54:09Z", "confidence": [1.0], "technique": "GitHub API"}, "dateModified": {"excerpt": "2022-04-18T22:02:51Z", "confidence": [1.0], "technique": "GitHub API"}, "name": {"excerpt": "rawgraphs-app", "confidence": [1.0], "technique": "GitHub API"}, "fullName": {"excerpt": "rawgraphs/rawgraphs-app", "confidence": [1.0], "technique": "GitHub API"}, "issueTracker": {"excerpt": "https://api.github.com/repos/rawgraphs/rawgraphs-app/issues{/number}", "confidence": [1.0], "technique": "GitHub API"}, "forksUrl": {"excerpt": "https://api.github.com/repos/rawgraphs/rawgraphs-app/forks", "confidence": [1.0], "technique": "GitHub API"}, "downloadUrl": {"excerpt": "https://github.com/rawgraphs/rawgraphs-app/releases", "confidence": [1.0], "technique": "GitHub API"}, "topics": {"excerpt": ["svg", "vector-graphics", "data-visualization", "rawgraphs", "d3js", "data", "ddj", "design", "visualization"], "confidence": [1.0], "technique": "GitHub API"}, "stargazersCount": {"excerpt": {"count": 8100, "date": "Tue, 19 Apr 2022 14:20:01 GMT"}, "confidence": [1.0], "technique": "GitHub API"}, "forksCount": {"excerpt": {"count": 1829, "date": "Tue, 19 Apr 2022 14:20:01 GMT"}, "confidence": [1.0], "technique": "GitHub API"}, "languages": {"excerpt": ["JavaScript", "SCSS", "CSS", "HTML"], "confidence": [1.0], "technique": "GitHub API"}, "readmeUrl": {"excerpt": "https://github.com/rawgraphs/rawgraphs-app/blob/master/README.md", "confidence": [1.0], "technique": "GitHub API"}, "licenseText": {"excerpt": "b'                                 Apache License\\n                           Version 2.0, January 2004\\n                        http://www.apache.org/licenses/\\n\\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\\n\\n   1. Definitions.\\n\\n      \"License\" shall mean the terms and conditions for use, reproduction,\\n      and distribution as defined by Sections 1 through 9 of this document.\\n\\n      \"Licensor\" shall mean the copyright owner or entity authorized by\\n      the copyright owner that is granting the License.\\n\\n      \"Legal Entity\" shall mean the union of the acting entity and all\\n      other entities that control, are controlled by, or are under common\\n      control with that entity. For the purposes of this definition,\\n      \"control\" means (i) the power, direct or indirect, to cause the\\n      direction or management of such entity, whether by contract or\\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\\n      outstanding shares, or (iii) beneficial ownership of such entity.\\n\\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\\n      exercising permissions granted by this License.\\n\\n      \"Source\" form shall mean the preferred form for making modifications,\\n      including but not limited to software source code, documentation\\n      source, and configuration files.\\n\\n      \"Object\" form shall mean any form resulting from mechanical\\n      transformation or translation of a Source form, including but\\n      not limited to compiled object code, generated documentation,\\n      and conversions to other media types.\\n\\n      \"Work\" shall mean the work of authorship, whether in Source or\\n      Object form, made available under the License, as indicated by a\\n      copyright notice that is included in or attached to the work\\n      (an example is provided in the Appendix below).\\n\\n      \"Derivative Works\" shall mean any work, whether in Source or Object\\n      form, that is based on (or derived from) the Work and for which the\\n      editorial revisions, annotations, elaborations, or other modifications\\n      represent, as a whole, an original work of authorship. For the purposes\\n      of this License, Derivative Works shall not include works that remain\\n      separable from, or merely link (or bind by name) to the interfaces of,\\n      the Work and Derivative Works thereof.\\n\\n      \"Contribution\" shall mean any work of authorship, including\\n      the original version of the Work and any modifications or additions\\n      to that Work or Derivative Works thereof, that is intentionally\\n      submitted to Licensor for inclusion in the Work by the copyright owner\\n      or by an individual or Legal Entity authorized to submit on behalf of\\n      the copyright owner. For the purposes of this definition, \"submitted\"\\n      means any form of electronic, verbal, or written communication sent\\n      to the Licensor or its representatives, including but not limited to\\n      communication on electronic mailing lists, source code control systems,\\n      and issue tracking systems that are managed by, or on behalf of, the\\n      Licensor for the purpose of discussing and improving the Work, but\\n      excluding communication that is conspicuously marked or otherwise\\n      designated in writing by the copyright owner as \"Not a Contribution.\"\\n\\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\\n      on behalf of whom a Contribution has been received by Licensor and\\n      subsequently incorporated within the Work.\\n\\n   2. Grant of Copyright License. Subject to the terms and conditions of\\n      this License, each Contributor hereby grants to You a perpetual,\\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\\n      copyright license to reproduce, prepare Derivative Works of,\\n      publicly display, publicly perform, sublicense, and distribute the\\n      Work and such Derivative Works in Source or Object form.\\n\\n   3. Grant of Patent License. Subject to the terms and conditions of\\n      this License, each Contributor hereby grants to You a perpetual,\\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\\n      (except as stated in this section) patent license to make, have made,\\n      use, offer to sell, sell, import, and otherwise transfer the Work,\\n      where such license applies only to those patent claims licensable\\n      by such Contributor that are necessarily infringed by their\\n      Contribution(s) alone or by combination of their Contribution(s)\\n      with the Work to which such Contribution(s) was submitted. If You\\n      institute patent litigation against any entity (including a\\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\\n      or a Contribution incorporated within the Work constitutes direct\\n      or contributory patent infringement, then any patent licenses\\n      granted to You under this License for that Work shall terminate\\n      as of the date such litigation is filed.\\n\\n   4. Redistribution. You may reproduce and distribute copies of the\\n      Work or Derivative Works thereof in any medium, with or without\\n      modifications, and in Source or Object form, provided that You\\n      meet the following conditions:\\n\\n      (a) You must give any other recipients of the Work or\\n          Derivative Works a copy of this License; and\\n\\n      (b) You must cause any modified files to carry prominent notices\\n          stating that You changed the files; and\\n\\n      (c) You must retain, in the Source form of any Derivative Works\\n          that You distribute, all copyright, patent, trademark, and\\n          attribution notices from the Source form of the Work,\\n          excluding those notices that do not pertain to any part of\\n          the Derivative Works; and\\n\\n      (d) If the Work includes a \"NOTICE\" text file as part of its\\n          distribution, then any Derivative Works that You distribute must\\n          include a readable copy of the attribution notices contained\\n          within such NOTICE file, excluding those notices that do not\\n          pertain to any part of the Derivative Works, in at least one\\n          of the following places: within a NOTICE text file distributed\\n          as part of the Derivative Works; within the Source form or\\n          documentation, if provided along with the Derivative Works; or,\\n          within a display generated by the Derivative Works, if and\\n          wherever such third-party notices normally appear. The contents\\n          of the NOTICE file are for informational purposes only and\\n          do not modify the License. You may add Your own attribution\\n          notices within Derivative Works that You distribute, alongside\\n          or as an addendum to the NOTICE text from the Work, provided\\n          that such additional attribution notices cannot be construed\\n          as modifying the License.\\n\\n      You may add Your own copyright statement to Your modifications and\\n      may provide additional or different license terms and conditions\\n      for use, reproduction, or distribution of Your modifications, or\\n      for any such Derivative Works as a whole, provided Your use,\\n      reproduction, and distribution of the Work otherwise complies with\\n      the conditions stated in this License.\\n\\n   5. Submission of Contributions. Unless You explicitly state otherwise,\\n      any Contribution intentionally submitted for inclusion in the Work\\n      by You to the Licensor shall be under the terms and conditions of\\n      this License, without any additional terms or conditions.\\n      Notwithstanding the above, nothing herein shall supersede or modify\\n      the terms of any separate license agreement you may have executed\\n      with Licensor regarding such Contributions.\\n\\n   6. Trademarks. This License does not grant permission to use the trade\\n      names, trademarks, service marks, or product names of the Licensor,\\n      except as required for reasonable and customary use in describing the\\n      origin of the Work and reproducing the content of the NOTICE file.\\n\\n   7. Disclaimer of Warranty. Unless required by applicable law or\\n      agreed to in writing, Licensor provides the Work (and each\\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\\n      implied, including, without limitation, any warranties or conditions\\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\\n      PARTICULAR PURPOSE. You are solely responsible for determining the\\n      appropriateness of using or redistributing the Work and assume any\\n      risks associated with Your exercise of permissions under this License.\\n\\n   8. Limitation of Liability. In no event and under no legal theory,\\n      whether in tort (including negligence), contract, or otherwise,\\n      unless required by applicable law (such as deliberate and grossly\\n      negligent acts) or agreed to in writing, shall any Contributor be\\n      liable to You for damages, including any direct, indirect, special,\\n      incidental, or consequential damages of any character arising as a\\n      result of this License or out of the use or inability to use the\\n      Work (including but not limited to damages for loss of goodwill,\\n      work stoppage, computer failure or malfunction, or any and all\\n      other commercial damages or losses), even if such Contributor\\n      has been advised of the possibility of such damages.\\n\\n   9. Accepting Warranty or Additional Liability. While redistributing\\n      the Work or Derivative Works thereof, You may choose to offer,\\n      and charge a fee for, acceptance of support, warranty, indemnity,\\n      or other liability obligations and/or rights consistent with this\\n      License. However, in accepting such obligations, You may act only\\n      on Your own behalf and on Your sole responsibility, not on behalf\\n      of any other Contributor, and only if You agree to indemnify,\\n      defend, and hold each Contributor harmless for any liability\\n      incurred by, or claims asserted against, such Contributor by reason\\n      of your accepting any such warranty or additional liability.\\n\\n   END OF TERMS AND CONDITIONS\\n\\n   APPENDIX: How to apply the Apache License to your work.\\n\\n      To apply the Apache License to your work, attach the following\\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\\n      replaced with your own identifying information. (Don\\'t include\\n      the brackets!)  The text should be enclosed in the appropriate\\n      comment syntax for the file format. We also recommend that a\\n      file or class name and description of purpose be included on the\\n      same \"printed page\" as the copyright notice for easier\\n      identification within third-party archives.\\n\\n   Copyright (c), 2013-2021 DensityDesign Lab, Calibro, INMAGIK \\n   &#104;&#101;&#108;&#108;&#111;&#64;&#114;&#97;&#119;&#103;&#114;&#97;&#112;&#104;&#115;&#46;&#105;&#111;\\n\\n   Licensed under the Apache License, Version 2.0 (the \"License\");\\n   you may not use this file except in compliance with the License.\\n   You may obtain a copy of the License at\\n\\n       http://www.apache.org/licenses/LICENSE-2.0\\n\\n   Unless required by applicable law or agreed to in writing, software\\n   distributed under the License is distributed on an \"AS IS\" BASIS,\\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\\n   See the License for the specific language governing permissions and\\n   limitations under the License.\\n'", "confidence": [1.0], "technique": "File Exploration"}, "contributingGuidelines": {"excerpt": "Contributing\nWant to contribute to RAWGraphs's development? You are more than welcome! Start by cloning the repository (the \"Code\" button at the top-right corner of this page) and follow the instructions in README file to install dependencies and set it up.\nThen you can use Github's issues and pull requests to discuss and share your work.\nYou will need to sign a Contributor License Agreement (CLA) before making a submission. It will be automatically prompted in the moment you will make a \"pull request\" to the repository. We adopted CLA to be sure that the project will remain open source.\nFor more information, write us: &#104;&#101;&#108;&#108;&#111;&#64;&#114;&#97;&#119;&#103;&#114;&#97;&#112;&#104;&#115;&#46;&#105;&#111;.\nThe \"obvius fix\" RULE\nInspired by CARTO \"obvious fix\" rule we decided to integrate that rule also into our contribution policy.\nRAWGraphs's contribution policy is aimed at encouraging broad participation from our community and minimizing risks to the project owners and our community due to inappropriate contributions of the intellectual property of others.\nAs a general standard, RAWGraphs requires every contributor to fill out a Contributor License Agreement (“CLA”), either individually or on behalf of a corporate entity.\nHOWEVER, very small contributions (such as fixing spelling errors), where the content change is small enough to not be considered intellectual property, can be submitted by a contributor as a patch, without a CLA.\nHow does the obvious fix rule work?\nAny committer may commit fixes without first signing a CLA for obvious typos, grammar mistakes, and formatting problems wherever they may be.\nWhenever you invoke the Obvious Fix Rule, please say so in your commit message. For example:\ncommit fed5f73b831906878a32bddaee98dcc5652f1716\nAuthor: giovanna &lt;giovanna@rawgraphs.io&gt;\nDate: Mon Feb 06 09:41:00 2017 +0100\nFix typo in README.\nObvious fix.\nWhat qualifies as an obvious fix?\nAn obvious fix is a pull request that does not contain creative work. We rely on your judgment to determine what is “obvious”; if you’re not sure, just ask by sending an email to: hello@rawgraphs.io\nAs a rule of thumb, changes are obvious fixes if they do not introduce any new functionality or creative thinking. As long as the change does not affect functionality, some likely examples include the following:\n\nSpelling/grammar fixes;\nCorrecting typos;\nCleaning up comments in the code;\nChanges to white space or formatting;\nBug fixes that change default return values or error codes stored in constants, literals, or simple variable types;\nAdding logging messages or debugging output;\nChanges to ‘metadata’ files like Gemfile, rebar.config, Makefile, app.config, sys.config, .gitignore, example configuration files, build scripts, etc.;\nChanges that reflect outside facts, like renaming a build directory or changing a constant;\nChanges in build or installation scripts;\nRe-ordering of objects or subroutines within a source file (such as alphabetizing routines);\nMoving source files from one directory or package to another, with no changes in code;\nBreaking a source file into multiple source files, or consolidating multiple source files into one source file, with no change in code behavior;\nChanges to words or phrases isolated from their context;\nChanges to typeface.", "confidence": [1.0], "technique": "File Exploration"}, "releases": {"excerpt": [{"tagName": "v2.0.0-beta.11", "name": "v2.0.0-beta.11", "authorName": "mikima", "authorType": "User", "body": "#### Interface - Changes\r\n\r\n- fixed SPARQL loader (thanks @tpluscode)\r\n- updated readme (thanks @vladdoster)\r\n- updated links\r\n- Updated rawgraphs-charts from v1.0.0-beta-21 to [v1.0.0-beta.26](https://github.com/rawgraphs/rawgraphs-charts)\r\n\r\n#### Charts - New features\r\n\r\n- _slope chart_: added chart\r\n- _pie chart_: added chart\r\n- _line chart_: added controls for ticks\r\n\r\n#### Charts - Changes\r\n\r\n- _slope chart_: fixed legend\r\n- _bar chart_: fixed sorting. fixed labels when datatype is date.\r\n- _beeswarm_: better naming of groups.\r\n- _bump chart_: fixed issue related to vertical padding.\r\n- _gantt chart_: now \"start date\" and \"end date\" visual variables accepts numbers.\r\n- _streamgraph_: fixed a bug causing the disappearing of streams.\r\n- _voronoi diagram_: changed category\r\n- _slope chart_: fixed error when no values are mapped on the \"series\" dimension. fixed typos.\r\n- _pie chart_: added size to legend when series are mapped.\r\n- _pie chart_: labels on arcs now show the arc value\r\n- added tutorials for _pie chart_ and _slope chart_", "tarballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/tarball/v2.0.0-beta.11", "zipballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/zipball/v2.0.0-beta.11", "htmlUrl": "https://github.com/rawgraphs/rawgraphs-app/releases/tag/v2.0.0-beta.11", "url": "https://api.github.com/repos/rawgraphs/rawgraphs-app/releases/51538571", "dateCreated": "2021-10-18T12:21:42Z", "datePublished": "2021-10-18T13:00:17Z"}, {"tagName": "v2.0.0-beta.10", "name": "v2.0.0-beta.10", "authorName": "mikima", "authorType": "User", "body": "#### New Features\r\n\r\n- added Voronoi diagram\r\n- added Horizon graph\r\n- added Parallel coordinates\r\n- New datasamples according to upcoming learning section\r\n- Added sources to data samples\r\n- Added links to tutorials\r\n- Added links to source code\r\n\r\n#### Changes\r\n\r\n- update rawgraphs-charts to 1.0.0-beta.21\r\n- updated rawgrahps-core to 1.0.0-beta.15\r\n- Various bugfixing", "tarballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/tarball/v2.0.0-beta.10", "zipballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/zipball/v2.0.0-beta.10", "htmlUrl": "https://github.com/rawgraphs/rawgraphs-app/releases/tag/v2.0.0-beta.10", "url": "https://api.github.com/repos/rawgraphs/rawgraphs-app/releases/44091197", "dateCreated": "2021-06-04T07:31:21Z", "datePublished": "2021-06-04T08:09:43Z"}, {"tagName": "v2.0.0-beta.9", "name": "v2.0.0-beta.9", "authorName": "mikima", "authorType": "User", "body": "- updated rawgrahps-core to 1.0.0-beta.14 (number parsing with separators)\r\n- update rawgraphs-charts, added gantt chart", "tarballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/tarball/v2.0.0-beta.9", "zipballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/zipball/v2.0.0-beta.9", "htmlUrl": "https://github.com/rawgraphs/rawgraphs-app/releases/tag/v2.0.0-beta.9", "url": "https://api.github.com/repos/rawgraphs/rawgraphs-app/releases/40812228", "dateCreated": "2021-04-01T10:38:06Z", "datePublished": "2021-04-01T10:42:00Z"}, {"tagName": "v2.0.0-beta.8", "name": "", "authorName": "mikima", "authorType": "User", "body": "", "tarballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/tarball/v2.0.0-beta.8", "zipballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/zipball/v2.0.0-beta.8", "htmlUrl": "https://github.com/rawgraphs/rawgraphs-app/releases/tag/v2.0.0-beta.8", "url": "https://api.github.com/repos/rawgraphs/rawgraphs-app/releases/38766584", "dateCreated": "2021-02-25T19:41:23Z", "datePublished": "2021-02-25T21:06:17Z"}, {"tagName": "v2.0.0-beta.6", "name": "v2.0.0-beta.6", "authorName": "uf0", "authorType": "User", "body": "### ⚠️ RAWGraph 2.0 is here! ⚠️\r\nToday is the big day!\r\n\r\nOne year after the end of a successful crowdfunding campaign, and few months after the release of the beta version to our sponsors and supporters, we are very excited to publicly release the first version of RAWGraphs 2.0 to everyone.\r\n\r\nStay tuned for more updates!\r\n", "tarballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/tarball/v2.0.0-beta.6", "zipballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/zipball/v2.0.0-beta.6", "htmlUrl": "https://github.com/rawgraphs/rawgraphs-app/releases/tag/v2.0.0-beta.6", "url": "https://api.github.com/repos/rawgraphs/rawgraphs-app/releases/38476626", "dateCreated": "2021-02-25T13:00:23Z", "datePublished": "2021-02-23T10:20:58Z"}, {"tagName": "v1.3.0", "name": "v1.3.0", "authorName": "mikima", "authorType": "User", "body": "### libraries\r\n* Updated libraries\r\n* Rewrote all visual models using d3 v5.x\r\n\r\n### Charts\r\n* [Added] swarm plots visual model\r\n* [Added] contour plot visual model\r\n* [Removed] Delauney visual model\r\n* [Removed] cluster force visual model\r\n* [Change] Box Plot: Added color option\r\n* [Change] Horizon Graphs: It is now possible to change colors\r\n* [Change] Visual models with vertical axis now have a ‘left margin’ option\r\n* [Change] Labels are rotated correctly on the left side\r\n\r\n", "tarballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/tarball/v1.3.0", "zipballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/zipball/v1.3.0", "htmlUrl": "https://github.com/rawgraphs/rawgraphs-app/releases/tag/v1.3.0", "url": "https://api.github.com/repos/rawgraphs/rawgraphs-app/releases/11386231", "dateCreated": "2018-06-05T15:11:48Z", "datePublished": "2018-06-08T08:52:22Z"}, {"tagName": "v1.2.0", "name": "v1.2.0", "authorName": "uf0", "authorType": "User", "body": "### Data import\n- Import data from a file by drag and drop. Supported files: plain texts (CSV, TSV) and Microsoft Excel files (XLSX), JSON files.\n- Load data from URL (VERY experimental, only for websites with cross-origin resource sharing enabled, [see here](http://enable-cors.org/))\n- Parse JSON files (both by copy and paste or by drag and drop), load arrays of objects as tables.\n- Stack/unstack your data! If you have the dataset as a matrix, you can easily convert it in a dataset within the RAW interface. [See here](https://en.wikipedia.org/wiki/Wide_and_narrow_data) for more information about stacked/unstacked (or wide/narrow) data.\n\n### Data samples\n- More data samples, one example per graph type.\n\n### Visual models\n- Added chart categories: charts are now grouped by type (e.g. hierarchies, dispersions, time series…)\n- Added new visual models: Sunburst, Bump Charts, Horizon Charts, Box Plot, Pie Charts, Bar Charts.\n- Improved existing models, adding new options and addressing suggestions provided by users.\n\n### Visualization\n- When a field is mandatory (e.g. hierarchy in treemap), instead of displaying the visualization, the list of the required fields will appear.\n\n### License\n- We changed the license to Apache 2.0. The project remains open-source, and the new licence allows you to reuse the code with any other kind of license.\n", "tarballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/tarball/v1.2.0", "zipballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/zipball/v1.2.0", "htmlUrl": "https://github.com/rawgraphs/rawgraphs-app/releases/tag/v1.2.0", "url": "https://api.github.com/repos/rawgraphs/rawgraphs-app/releases/5172841", "dateCreated": "2017-01-16T16:52:42Z", "datePublished": "2017-01-16T17:11:51Z"}, {"tagName": "1.0.2", "name": "1.0.2 Bump Charts and bug fixes", "authorName": "giorgiocaviglia", "authorType": "User", "body": "- Added Bump Charts\n- Fixed several bugs\n- Using native canvas conversion instead of canvg\n- Using Date instead of moment (improved performances)\n- Updated CodeMirror (4.5)\n", "tarballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/tarball/1.0.2", "zipballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/zipball/1.0.2", "htmlUrl": "https://github.com/rawgraphs/rawgraphs-app/releases/tag/1.0.2", "url": "https://api.github.com/repos/rawgraphs/rawgraphs-app/releases/534265", "dateCreated": "2014-09-04T01:50:56Z", "datePublished": "2014-09-04T03:02:30Z"}, {"tagName": "1.0.1", "name": "1.0.1", "authorName": "giorgiocaviglia", "authorType": "User", "body": "- Added Small Multiples chart\n- Minor CSS fixes\n- Dates parsing improved for Scatterplot, Hexagonal Binning and Streamgraph\n", "tarballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/tarball/1.0.1", "zipballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/zipball/1.0.1", "htmlUrl": "https://github.com/rawgraphs/rawgraphs-app/releases/tag/1.0.1", "url": "https://api.github.com/repos/rawgraphs/rawgraphs-app/releases/357601", "dateCreated": "2014-06-04T22:31:08Z", "datePublished": "2014-06-04T22:32:19Z"}, {"tagName": "1.0", "name": "1.0", "authorName": "giorgiocaviglia", "authorType": "User", "body": "", "tarballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/tarball/1.0", "zipballUrl": "https://api.github.com/repos/rawgraphs/rawgraphs-app/zipball/1.0", "htmlUrl": "https://github.com/rawgraphs/rawgraphs-app/releases/tag/1.0", "url": "https://api.github.com/repos/rawgraphs/rawgraphs-app/releases/264694", "dateCreated": "2014-04-09T18:11:13Z", "datePublished": "2014-04-09T19:39:26Z"}], "confidence": [1.0], "technique": "GitHub API"}}